app/Models/PlayerModel.php

SELECT `jugadores`.*, `liga`.*
FROM `jugadores`
JOIN `liga` ON `jugadores`.`liga`=`liga`.`idLiga`
SELECT *
FROM `liga`
---
    public function getPlayers($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('jugadores.*,liga.*');
            $sql = $this->join('liga','jugadores.liga=liga.idLiga');
            $sql = $this->findAll();
            return $sql;
            }
            $sql = $this->select('jugadores.*,liga.*');
            $sql = $this->join('liga','jugadores.liga=liga.idLiga');
            $sql = $this->where(['slug' => $slug]);
            $sql = $this->first();